/* 基础知识 */

//Hello World代码
//////////////////////////////////////////////////////////////////////////////////////////////////////
#include <stdio.h>
int main()
{
    printf("Hello World");
    return 0;
}
//////////////////////////////////////////////////////////////////////////////////////////////////////

#include <stdio.h> //包含一个叫stdio.h的文件
// std-标准 standard input output(标准输入输出)

int main() //主函数-程序的入口-main函数有且只有一个
{
    //这里完成任务
    //在屏幕上输出hello world
    //函数-print function-printf-打印函数 eg:printf("")-双引号内输入想输出的值
    //库函数-C语言本身提供我们使用的函数
    //别人的东西-打招呼
    //#include
    return 0; //返回 0
}

// int 是整型的意思
// main前面的int表示main函数调用返回一个整型值

//////////////////////////////////////////////////////////////////////////////////////////////////////

//数据类型:
/*****************************************************************************************************
    char            //字符数据类型
    short           //短整型
    int             //整型
    long            //长整型
    long long       //更长的整型
    float           //单精度浮点数
    double          //双精度浮点数
    !!!作用:用来向内存申请空间,来创建变量!!!
 ****************************************************************************************************/
//定义变量的方式: 类型+变量名 赋予一个 值;       eg: short age = 16;

// char-字符类型:
int main()
{
    char ch = 'A';      //向内存申请1个字节=8bits,用来存放A
    printf("%c\n", ch); //%c-打印字符格式的数据(我以字符的形式打印变量ch)
    return 0;
}

// int-整型:
int main()
{
    int age = 20;        //向内存申请4个字节=32bits,用来存放20
    printf("%d\n", age); //%d-打印整型十进制数据(我以整形的形式打印变量age)
    return 0;
}

// short-短整型
int main()
{
    short sh = 6;       //向内存申请2个字节=16bits,用来存放6
    printf("%d\n", sh); //%d-打印整型十进制数据(我以短整型的形式打印变量sh)
    return 0;
}

// long-长整型
int main()
{
    long num = 100;      //向内存申请4/8个字节=32/64bits,用来存放100
    printf("%d\n", num); //%d-打印整型十进制数据(我以长整型的形式打印变量num)
    return 0;
}

// float-单精度浮点型
int main()
{
    float f = 5.0f;    //向内存申请4个字节=32bits,用来存放5.0
    printf("%f\n", f); //%f-打印浮点数字[打印小数](我以单精度浮点型的形式打印变量f)
    return 0;
}

// double-双精度浮点型
int main()
{
    double d = 3.14;    //向内存申请8个字节=64bits,用来存放3.14
    printf("%lf\n", d); //%lf-打印浮点数字[打印小数](我以双精度浮点型的形式打印变量d)
    return 0;
}

// 注意!!!   \n  表示换行

//////////////////////////////////////////////////////////////////////////////////////////////////////

int main()
{
    printf("%d\n", sizeof(char));      // 1字节
    printf("%d\n", sizeof(short));     // 2字节
    printf("%d\n", sizeof(int));       // 4字节
    printf("%d\n", sizeof(long));      // 4/8字节
    printf("%d\n", sizeof(long long)); // 8字节
    printf("%d\n", sizeof(float));     // 4字节
    printf("%d\n", sizeof(double));    // 8字节
    return 0;
}

//////////////////////////////////////////////////////////////////////////////////////////////////////

//不同的%打印什么?
//%d-打印整型
//%c-打印字符
//%f-打印浮点数字(打印小数)
//%s-打印字符串
//%p-以地址的形式打印
//%x-打印16进制数字

//////////////////////////////////////////////////////////////////////////////////////////////////////

//《《《局部变量和全局变量》》》
int num2 = 20; //全局变量-定义在代码块({})之外的变量
int main()
{
    int num1 = 10; //局部变量-定义在代码块({})内部的变量
    return 0;
}

int a = 100;//(全局变量)
 int main()
{
    int a = 10;//(局部变量)
    //局部变量和全局变量名字建议不要相同-容易误会,产生bug
    //当局部变量和全局变量的名字相同的时候,局部变量优先
    printf("%d\n",a);
    return 0;
}

//1.局部变量的作用域是变量所在的局部范围
//2.全局变量的作用域是整个工程

//1.局部变量的生命周期是:进入作用域生命周期开始,出作用域生命周期结束
//2.全局变量的生命周期是:整个程序的生命周期


int main()
{                                                //另一个文件:
    //未声明的标识符                              
    /*extern-声明非此文件中的外部符号*/                int g_val = 2021;                
                                                 
    extern int g_varl;
    printf("g_val=%d\n",g_val);
    return 0;
}
//////////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////////////////
int main()
{
    //枚举常量    枚举:一一列举  (如下)
    //性别:男,女,保密
    //三原色:红,黄,蓝
    //星期:1,2,3,4,5,6,7
    //枚举关键 - enum
    enum Sex
    {
        MALE,
        FEMALE,
        SECRET
    };
    //MALE , FEMALE , SSECRET - 枚举常量
/*enum Color
{
    RED,
    YELLOW,
    BLUE
};              */}

int main()



/*
{
    enum Color color = BLUE;  
    color = YELLOW; //枚举常量中，变量可变
    BLUE = 6; //上面大括号中的枚举常量不能变
    return 0;
}                             */


    //#define 定义的标识符常量       define-定义
    #define MAX 10 //用define把MAX定义为常量10


    //const - 常属性
    //const int n = 10; //n是变量，但是又有常属性(被const赋予常属性)，所以我们说n是常变量
    //int arr[n] = {0};//此行是错误的！！！！因为[]内需要输入常量,n只是拥有常量属性的变量
    //n = 20; ！！！此时n不能再被赋予其他值，因为140行中n被const赋予常属性
    //const修饰的常变量
    //const int num = 4;
    //printf("%d\n",num);
    // num = 8; 此时变量num(144行，被const赋予常属性)不能再被赋予其他值


/*    //字面常量:
int main()
{
    3;
    100;
    3.14;

    return 0;
}                  */

//////////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////////////////

#include <stdio.h>
int main()
{
    //计算两个数的和
    int num1 = 0;
    int num2 = 0;
    int sum = 0;

    //输入数据-使用输入函数scanf
    scanf("%d%d", &num1,&num2);//&-取地址符号
    //C语言语法规定,变量要定义在当前代码块的最前面
    sum = num1 + num2;
    printf("sum = %d\n", sum);
    return 0;

}
///////////////////////////////////////////////////////////////////////////////////////////////////////

//字符串类型
#include <stdio.h>
int main()
{
    "abcdefg";
    "hello World";
    "";//空字符串
    return 0;
}

字符串
    "hello world.\n"
这种由双引号(Double Quote)引起来的一串字符称为字符串字面值(String Literal),或者简称字符串。
注:字符串的结束标志是一个\0的转义字符。在计算字符串长度的时候\0是结束标志，不算作字符串内容。


int main()
{
    char arr1[] = "abc";//数组--把字符串放到字符数组里面
    //"abc" -- 'a' 'b' 'c' '\0' -- '\0'字符串结束的标志
    char arr2[] = {'a', 'b' ,'c', '\0'};
    //'\0' - 0(值)
    //'a' - 97(值)
    //'a' 'b' 'c' 
    printf("%s\n",arr1);   //%s-打印字符串
    printf("%s\n",arr2);
    return 0;
}


#include <stdio.h>
#include <string.h> //注意！！！  使用strlen函数需要添加 <string.h>头文件

int main()
{
    char arr1[] = "abc";
    char arr2[] = {'a','b','c'};
    printf("%d\n",strlen(arr1));//strlen - string length - 计算字符串长度的
    printf("%d\n",strlen(arr2));
    return 0;
}


//数据在计算机上储存的时候,储存的是2进制
//a - 97
//A - 65
//ASCII 编码
//ASCII 码值


《《《转义字符》》》
eg:
int main()
{
    printf("abcn");
    return 0;
}
//此时打印的是 abcn 
但是在n的前面加一个 \ 后,n原来的意思改变,此时\n是换行的意思
eg:
int main()
{
    printf("abc\n");
    return 0;
}
//此时打印的是 abc

转义字符:转变意思

转义字符        释义
\?             在书写连续多个问号时使用,防止他们被解析成三字母词    如: \?\? 就表示两个问号 ?? 
\'             用于表示字符常量' 如:要表示'''  两个单引号中引一个单引号,此时编译器会把前两个单引号 ''
               配为一对,此时只需要在中间的'前加一个\即可: '\''
\"             用于表示一个字符串内部的双引号 如:"\""
\\             用于表示一个反斜杠,防止它被解释为一个转义序列符。  如: \\ 表示一个 \
\a             警告字符,蜂鸣
\b             退格符
\f             进纸符
\n             换行
\r             回车
\t             水平制表符
\v             垂直制表符
\ddd           ddd表示1~3个八进制的数字。 如: \130 X 
\xdd           dd表示2个十六进制数字。 如:\x30 0

转义字符是1个字符,长度为1  如:\n是1个字符,长度为1